In [2]:
import sqlite3

In [7]:
con = sqlite3.connect('student2.sqlite3')

In [9]:
cur = con.cursor()

In [13]:
create_table_query = '''

create table student2(
id int primary key,
name varchar(200) not null,
address varchar(200) not null,
college varchar(200) not null,
faculty varchar(20) not null,
age int not null,
gender varchar(1) not null
);

'''
cur.execute (create_table_query)

OperationalError: table student2 already exists

In [17]:
insert_data = '''
insert into student2
('id' , 'name' , 'address', 'college ', 'faculty' , 'age' , 'gender')
values
(1,'ram' , 'kathmandu', 'ncit',  'IT' , 18, 'm'),
(2, 'shyam', 'lalitpur', 'kmc' , 'CSIT' ,20, 'm' ,),
(3, 'gita', 'pokhara' , 'ncit', 'SE',20, 'm' ,),
(4, 'sita' , 'kathmandu', 'ioe pulchowk',  'CE', 24, 'f');

'''

cur.execute(insert_data)

OperationalError: near ")": syntax error